#pragma once

// =========================================================================================
// プリコンパイルヘッダーに書いたものは、初回のみ解析されるためコンパイル時間が高速になる。
// プロパティの設定から必ず使用されるインクルードファイルに"PCH.h"を指定することで定数などの
// 定義を他のヘッダーが読み込まれる前に指定できるので、依存関係の問題を回避できる。
// ただし、"PCH.h"に書いたヘッダーに変更があった場合再度すべてのソースファイルが
// 再解析されるのでコンパイル時間が長くなる。
// =========================================================================================

// =========================================================================================
// 基本
// =========================================================================================
#pragma comment(lib , "winmm.lib")
#pragma comment(lib , "Rpcrt4.lib")

#define NOMINMAX
#include <Windows.h>
#include <stdio.h>

#include <wrl/client.h>

// =========================================================================================
// "STL"
// =========================================================================================
#include <map>
#include <unordered_map>
#include <unordered_set>
#include <string>
#include <array>
#include <vector>
#include <stack>
#include <list>
#include <iterator>
#include <queue>
#include <algorithm>
#include <memory>
#include <random>
#include <fstream>
#include <iostream>
#include <sstream>
#include <functional>
#include <thread>
#include <atomic>
#include <mutex>
#include <future>
#include <filesystem>
#include <source_location>
#include <codecvt>

// =========================================================================================
// 外部ライブラリ
// =========================================================================================
#include "json.hpp"
#include "strconv2.h"

// =========================================================================================
// 自作フレームワーク
// =========================================================================================
#include "Framework/Framework.h"